#Q1

In [16]:
import pandas as pd

In [17]:
data=[4,8,15,16,23,42]
series=pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#Q2

In [18]:
my_list = [1,3,4,5,6,7,8,9,2,10]
series=pd.Series(my_list)

In [19]:
series

0     1
1     3
2     4
3     5
4     6
5     7
6     8
7     9
8     2
9    10
dtype: int64

#Q3

In [20]:

data={
'Name':['Alice','BoB','Claire'],
'Age':[25,30,27],
'Gender':['Female','Male','Female']
}

In [21]:
df=pd.DataFrame(data)

In [22]:
df

     Name  Age  Gender
0   Alice   25  Female
1     BoB   30    Male
2  Claire   27  Female

#Q4

In pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different data types. It is similar to a spreadsheet or SQL table, where data is arranged in rows and columns. Each column in a DataFrame is a pandas Series.

On the other hand, a pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, Python objects, etc.). It is essentially a single column of data.

Here's an example to illustrate the difference:

In [23]:
data=[1,2,3,4]
series=pd.Series(data)

In [24]:
series

0    1
1    2
2    3
3    4
dtype: int64

In [25]:
df=pd.DataFrame(data)

In [26]:
df

   0
0  1
1  2
2  3
3  4

#Q5

In [30]:
data = {'A':range(1,11), 'B':range(11,21)}

In [31]:
df=pd.DataFrame(data)

# SOME FUNCTIONS

In [33]:
df.head()

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [34]:
df.tail(3)

    A   B
7   8  18
8   9  19
9  10  20

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int64
 1   B       10 non-null     int64
dtypes: int64(2)
memory usage: 288.0 bytes

In [37]:
df.describe()

              A         B
count  10.00000  10.00000
mean    5.50000  15.50000
std     3.02765   3.02765
min     1.00000  11.00000
25%     3.25000  13.25000
50%     5.50000  15.50000
75%     7.75000  17.75000
max    10.00000  20.00000

#Q6

In Pandas, both Series and DataFrame are mutable in nature, whereas Panel is deprecated and has been removed from newer versions of Pandas.

Series: A one-dimensional labeled array capable of holding any data type. It is mutable, meaning you can modify the elements of a Series after it has been created.

DataFrame: A two-dimensional labeled data structure with columns of potentially different types. Like Series, DataFrame is also mutable, allowing you to modify its content after creation.

Panel: A three-dimensional data structure that was removed from Pandas as of version 0.25.0 due to lack of consistent use and developer resources. It was replaced by better alternatives for handling three-dimensional data, such as using MultiIndex with DataFrame.

Since Series and DataFrame are mutable, you can modify their content, add or remove rows and columns, and perform various other operations to manipulate the data they contain.

#Q7

In [49]:
series1 = pd.Series([1,2,3,4])
series2 = pd.Series([5,6,7,8])

In [50]:
df = pd.DataFrame({ 'Column_1': series1 , 'Column_2': series2})

In [51]:
df

   Column_1  Column_2
0         1         5
1         2         6
2         3         7
3         4         8